Pontif√≠cia Universidade Cat√≥lica de S√£o Paulo 

`Ci√™ncia de Dados e Intelig√™ncia Artificial`

#üéì Aula 3 - Processamento de Dados em Python usando Pandas
19 de agosto de 2021

---
> üë®‚Äçüè´*Professor Rooney Coelho (rracoelho@pucsp.br)*
---

In [1]:
# Inicialmente execute este bloco para as depend√™ncias
import pandas as pd

### 1) Dado o seguinte `DataFrame`, fa√ßa o que se pede:

In [2]:
# Aperte Ctrl+Enter
df=pd.DataFrame({'a':[11,21,31],'b':[21,22,23]})

a) Mostre as tr√™s primeiras linhas de df

In [3]:
df

    a   b
0  11  21
1  21  22
2  31  23

b) Obtenha a coluna 'a'

In [4]:
df["a"]

0    11
1    21
2    31
Name: a, dtype: int64

### 2) Dado o seguinte DataFrame, fa√ßa o que se pede:

In [11]:
# Aperte Ctrl+Enter
df=pd.DataFrame({'a':[1,2,1],'b':[1,1,1]})

a) Identifique os valores √∫nicos na coluna `a`.

In [20]:
df['a'].unique()

array([1, 2], dtype=int64)

b) Retorne um `Dataframe` com linhas somente onde a coluna `a` √© menor que 2.

In [25]:
df_2 =df['a'] < 2
filtro = df[df_2]
filtro

   a  b
0  1  1
2  1  1

### 3) Carregue o Dataset do Titanic e fa√ßa o que se pede.

In [59]:
# Aperte Ctrl+Enter para carregar o Dataset
df=pd.read_csv("http://bit.ly/kaggletrain")

a) Confira os dados imprimindo o seu cabe√ßalho.

In [83]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

b) Confira se a coluna `PassengerId` e veja se todos os seus valores s√£o √∫nicos.

In [61]:
passageiros = df["PassengerId"]
unique = len(passageiros.unique()) == len(passageiros)
unique

True

b) Confira se a coluna `Ticket` possui e veja se todos os seus valores s√£o √∫nicos.

In [62]:
passageiros = df["Ticket"]
unico = len(passageiros.unique()) == len(passageiros)
unico

False

c) Torne a coluna `PassengerId` a chave prim√°ria de df.

In [63]:
df.set_index('PassengerId', inplace=True)

d) Utilize um m√©todo para a estat√≠stica descritiva desse `Dataset`

In [67]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### 4) Fa√ßa o que se pede.

a) Imprima os dados da pessoa mais velha que estava no navio.

In [86]:
maxima_idade = int(df['Age'].max())
df.query('Age == {}'.format(maxima_idade))

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

b) Imprima os dados do passageiro cujo n√∫mero do √≠ndice √© 789

In [87]:
df.query('PassengerId == 789')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
789,1,3,"Dean, Master. Bertram Vere",male,1.0,1,2,C.A. 2315,20.575,NaN,S

c) Um historiador encontrou o `Ticket` 17474 do Titanic. Localize esse passageiro para entrar em contato com seus familiares e notific√°-los desse achado. Essa pessoa sobreviveu?

In [95]:
df[df.Ticket == '17474']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
691,1,1,"Dick, Mr. Albert Adrian",male,31.0,1,0,17474,57.0,B20,S
782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1,0,17474,57.0,B20,S

### 5) Para as tr√™s classes, fa√ßa o que se pede.

a) Quantas pessoas est√£o na Primeira, Segunda e Terceira classes? Use a coluna `Pclass` para isso.

In [96]:
df.groupby(by='Pclass').size()

Pclass
1    216
2    184
3    491
dtype: int64

b) Qual a m√©dia de idade dos sobreviventes das tr√™s classes? Use o m√©todo `groupby` para isso.

In [99]:
df.groupby(by='Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

c) Qual a m√©dia de idade das pessoas que sobreviveram e morreram nas tr√™s classes? Use o m√©todo `groupby` para isso (note que s√£o dois agrupamentos).

In [108]:
import numpy as np
df.groupby(['Pclass', 'Survived']).agg({'Age': np.mean})

                       Age
Pclass Survived
1      0         43.695312
       1         35.368197
2      0         33.544444
       1         25.901566
3      0         26.555556
       1         20.646118

d) Qual a m√©dia de idade das pessoas de cada sexo que sobreviveram e morreram nas tr√™s classes? Use o m√©todo `groupby` para isso (note que s√£o tr√™s agrupamentos).

In [109]:
df.groupby(['Pclass', 'Survived','Sex']).agg({'Age': np.mean})

                              Age
Pclass Survived Sex
1      0        female  25.666667
                male    44.581967
       1        female  34.939024
                male    36.248000
2      0        female  36.000000
                male    33.369048
       1        female  28.080882
                male    16.022000
3      0        female  23.818182
                male    27.255814
       1        female  19.329787
                male    22.274211

### 6) Use o m√©todo `replace` para mudar a coluna `Survived` pela correspond√™ncia do seguinte dicion√°rio:

```python
di = {0: False, 1: True}
```

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html

In [111]:
di = {0: False, 1: True}

df['Survived'].replace(di)

PassengerId
1      False
2       True
3       True
4       True
5      False
       ...
887    False
888     True
889    False
890     True
891    False
Name: Survived, Length: 891, dtype: bool